---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.TrussType
source: html/8e1f5eed-da71-af37-b9b9-46f23e923556.htm
---
# TrussType Methods

Activates the symbol to ensure that its geometry is accessible.